using System;

/*
02 Create, compile and run a “Hello C#” console application.

ОБЯСНЕНИЕ: Традиционна първа задача, като за първа задач, а именно - да изпишем първото си тестово съобщение, което по традиция е прието да бъде "Hellow, world", но в случая в условието се иска да изпишем
“Hello C#”. Писането в конзолата в C# става чрез класа Console и метода WriteLine(). Може да се използва и методът Write(), като разликата между двата е, че когато програмата стигне до изпълнение на WriteLine(), то съдържанието вътре в скобите винаги ще бъде изписвано на нов ред.
Текстът, който искате да отпечатате задължително трябва да бъде сложен в кавички.
*/

class HellowCSharp
{
    static void Main()
    {
        Console.WriteLine("Hello C#");
    }
}

