using System;

/*
01. Write an expression that checks if given integer is odd or even.

ОБЯСНЕНИЕ: Целта тук в общи линии е да упражним работата на две неща - % операторът (който когато раздели връща остатъка от делението) и класически израз в C#, чиято цел е да провери дали едно число е четно или нечетно.
Четем число от конзолата и го Parse-ваме към int, така че да използваме стойнноста въведена от потребителя в изчисленията, които ще ни трябват. Без парсването, числата въведени от потребителя и записани в конзолата ще представляват обикновен string, а не числова променлива.
С помощта на if конструкция най-лесно проверяваме дали едно число е четно или не. Ако числото, което потребителят е въвел се дели на 2 без остатък (т.е. резултатът от % операцията е 0), то това значи че числото е четно. Съответно, ако има остатък - значи е нечетно.
 */

class ExpressionIntegerOddEven
{
    static void Main()
    {
        Console.WriteLine("Insert number here: ");
        int number = int.Parse(Console.ReadLine());

        if (number % 2 == 0)
        {
            Console.WriteLine("This number is even.");
        }
        else 
        {
            Console.WriteLine("This number is odd.");
        }
    }
}